ChanJoshi/STM32/stm32f407xx_rcc.c
//RCC APB1 peripheral reset register (RCC_APB1RSTR)
#define RCC_APB1RSTR_OFFSET      0x20
#define RCC_APB1RSTR_RESET_VALUE 0x00000000
#define RCC_APB1RSTR_DACRST_BIT  	29
#define RCC_APB1RSTR_PWRRST_BIT  	28
#define RCC_APB1RSTR_CAN2RST_BIT 	26
#define RCC_APB1RSTR_CAN1RST_BIT 	25
#define RCC_APB1RSTR_I2C3RST_BIT 	23
#define RCC_APB1RSTR_I2C2RST_BIT 	22
#define RCC_APB1RSTR_I2C1RST_BIT 	21 
#define RCC_APB1RSTR_UART5RST_BIT   20
#define RCC_APB1RSTR_UART4RST_BIT   19
#define RCC_APB1RSTR_UART3RST_BIT   18
#define RCC_APB1RSTR_UART2RST_BIT   17
#define RCC_APB1RSTR_SPI3RST_BIT 	15
#define RCC_APB1RSTR_SPI2RST_BIT 	14
#define RCC_APB1RSTR_WWDGRST_BIT 	11
#define RCC_APB1RSTR_TIM14RST_BIT  	8
#define RCC_APB1RSTR_TIM13RST_BIT  	7
#define RCC_APB1RSTR_TIM12RST_BIT  	6
#define RCC_APB1RSTR_TIM7RST_BIT  	5
#define RCC_APB1RSTR_TIM6RST_BIT  	4
#define RCC_APB1RSTR_TIM5RST_BIT  	3
#define RCC_APB1RSTR_TIM4RST_BIT  	2
#define RCC_APB1RSTR_TIM3RST_BIT  	1
#define RCC_APB1RSTR_TIM2RST_BIT    0

//RCC APB2 Peripheral reset register (RCC_APB2RSTR)
#define RCC_APB2RSTR_RESET_VALUE     0x00000000
#define RCC_APB2RSTR_OFFSET          0x24
#define RCC_APB2RSTR_TIM11RST_BIT    18
#define RCC_APB2RSTR_TIM10RST_BIT    17
#define RCC_APB2RSTR_TIM9RST_BIT     16
#define RCC_APB2RSTR_SYSCFGRST       14
#define RCC_APB2RSTR_SPI1_BIT        12
#define RCC_APB2RSTR_SDIORST_BIT     11
#define RCC_APB2RSTR_ADCRST_BIT      8
#define RCC_APB2RSTR_USART6RST       5
#define RCC_APB2RSTR_USART1RST       4
#define RCC_APB2RSTR_TIM8RST_BIT     1
#define RCC_APB2RSTR_TIM1RST_BIT     0

//RCC AHB1 peripheral clock enable register (RCC_AHB1ENR)
#define RCC_AHB1ENR_RESET_VALUE      0x00100000
#define RCC_AHB1ENR_OFFSET           0x30
#define RCC_AHB1ENR_OTGHSULPIEN_BIT  30
#define RCC_AHB1ENR_OTGHSEN_BIT      29
#define RCC_AHB1ENR_ETHMACPTPEN_BIT  28
#define RCC_AHB1ENR_ETHMACRXEN_BIT   27
#define RCC_AHB1ENR_ETHMACTXEN_BIT   26
#define RCC_AHB1ENR_ETHMACEN_BIT     25
#define RCC_AHB1ENR_DMA2EN_BIT       22
#define RCC_AHB1ENR_DMA1EN_BIT       21
#define RCC_AHB1ENR_CCMDATARAMEN_BIT 20
#define RCC_AHB1ENR_BKPSRAMEN_BIT    18
#define RCC_AHB1ENR_CRCEN_BIT        12
#define RCC_AHB1ENR_GPIOIEN_BIT      8
#define RCC_AHB1ENR_GPIOHEN_BIT      7
#define RCC_AHB1ENR_GPIOGEN_BIT      6
#define RCC_AHB1ENR_GPIOFEN_BIT      5
#define RCC_AHB1ENR_GPIOEEN_BIT      4
#define RCC_AHB1ENR_GPIODEN_BIT      3
#define RCC_AHB1ENR_GPIOCEN_BIT      2
#define RCC_AHB1ENR_GPIOBEN_BIT      1
#define RCC_AHB1ENR_GPIOAEN_BIT      0

//RCC AHB2 peripheral clock enable register
#define RCC_AHB2ENR_OFFSET           0x34
#define RCC_AHB2ENR_RESET_VALUE      0x00000000
#define RCC_AHB2ENR_DCMIEN_BIT       0
#define RCC_AHB2ENR_CRYPEN_BIT       4
#define RCC_AHB2ENR_HASHEN_BIT       5
#define RCC_AHB2ENR_RNGEN_BIT        6
#define RCC_AHB2ENR_OTGFSEN_BIT      7

//RCC AHB3 peripheral clock enable resgister
#define RCC_AHB3ENR_OFFSET           0x38
#define RCC_AHB3ENR_RESET_VALUE      0x00000000
#define RCC_AHB3ENR_FSMCEN_BIT       0

//RCC APB1 peripheral clock enable register (RCC_APB1ENR)
#define RCC_APB1ENR_RESET_VALUE  0x00000000
#define RCC_APB1ENR_OFFSET       0x40
#define RCC_APB1ENR_DACEN_BIT    29
#define RCC_APB1ENR_PWREN_BIT    28
#define RCC_APB1ENR_CAN2EN_BIT   26
#define RCC_APB1ENR_CAN1EN_BIT   25
#define RCC_APB1ENR_I2C3EN_BIT   23
#define RCC_APB1ENR_I2C2EN_BIT   22
#define RCC_APB1ENR_I2C1EN_BIT   21
#define RCC_APB1ENR_UART5EN_BIT  20
#define RCC_APB1ENR_UART4EN_BIT  19
#define RCC_APB1ENR_USART3EN_BIT 18
#define RCC_APB1ENR_USART2EN_BIT 17
#define RCC_APB1ENR_SPI3EN_BIT   15
#define RCC_APB1ENR_SPI2EN_BIT   14
#define RCC_APB1ENR_WWDGEN_BIT   11
#define RCC_APB1ENR_TIM14EN_BIT  8
#define RCC_APB1ENR_TIM13EN_BIT  7
#define RCC_APB1ENR_TIM12EN_BIT  6
#define RCC_APB1ENR_TIM7EN_BIT   5
#define RCC_APB1ENR_TIM6EN_BIT   4
#define RCC_APB1ENR_TIM5EN_BIT   3
#define RCC_APB1ENR_TIM4EN_BIT   2
#define RCC_APB1ENR_TIM3EN_BIT   1
#define RCC_APB1ENR_TIM2EN_BIT   0

//RCC APB2 peripheral clock enable register (RCC_APB2ENR)
#define RCC_APB2ENR_RESET_VALUE  0x00000000
#define RCC_APB2ENR_OFFSET       0x44
#define RCC_APB2ENR_MASK         0x00075F33
#define RCC_APB2ENR_TIM11EN      18
#define RCC_APB2ENR_TIM10EN      17
#define RCC_APB2ENR_TIM9EN       16
#define RCC_APB2ENR_SYSCFGEN_BIT 14
#define RCC_APB2ENR_SPI1EN_BIT   12
#define RCC_APB2ENR_SDIOEN_BIT   11
#define RCC_APB2ENR_ADC3EN_BIT   10
#define RCC_APB2ENR_ADC2EN_BIT   9
#define RCC_APB2ENR_ADC1EN_BIT   8
#define RCC_APB2ENR_USART6EN_BIT 5
#define RCC_APB2ENR_USART1EN_BIT 4
#define RCC_APB2ENR_TIM8EN_BIT   1
#define RCC_APB2ENR_TIM1EN_BIT   0

//RCC AHB1 peripheral clock enable in low power mode register (RCC_AHB1LPENR)
#define RCC_AHB1LPENR_RESET_VALUE   0x7E6791FF
#define RCC_AHB1LPENR_OFFSET        0x50
#define RCC_AHB1LPENR_OTGHSULPILPEN_BIT 30
#define RCC_AHB1LPENR_OTGHSLPEN_BIT     29
#define RCC_AHB1LPENR_ETHMACPTPLPEN_BIT 28
#define RCC_AHB1LPENR_ETHMACRXLPEN_BIT  27
#define RCC_AHB1LPENR_ETHMACTXLPEN_BIT  26
#define RCC_AHB1LPENR_ETHMACLPEN_BIT    25
#define RCC_AHB1LPENR_DMA2LPEN_BIT      22
#define RCC_AHB1LPENR_DMA1LPEN_BIT      21
#define RCC_AHB1LPENR_BKPSRAMLPEN_BIT   18
#define RCC_AHB1LPENR_SRAM2LPEN_BIT     17
#define RCC_AHB1LPENR_SRAM1LPEN_BIT     16
#define RCC_AHB1LPENR_FLITFLPEN_BIT     15
#define RCC_AHB1LPENR_CRCLPEN_BIT       12
#define RCC_AHB1LPENR_GPIOILPEN_BIT     8
#define RCC_AHB1LPENR_GPIOHLPEN_BIT     7
#define RCC_AHB1LPENR_GPIOGLPEN_BIT     6
#define RCC_AHB1LPENR_GPIOFLPEN_BIT     5
#define RCC_AHB1LPENR_GPIOELPEN_BIT     4
#define RCC_AHB1LPENR_GPIODLPEN_BIT     3 
#define RCC_AHB1LPENR_GPIOCLPEN_BIT     2 
#define RCC_AHB1LPENR_GPIOBLPEN_BIT     1 
#define RCC_AHB1LPENR_GPIOALPEN_BIT     0

//RCC AHB2 peripheral clock enable in low power mode register (RCC_AHB2LPENR)
#define RCC_AHB2LPENR_RESET_VALUE      0x000000F1
#define RCC_AHB2LPENR_OFFSET           0x54
#define RCC_AHB2LPENR_OTGFSLPEN_BIT    7
#define RCC_AHB2LPENR_RNGLPEN_BIT      6
#define RCC_AHB2LPENR_HASHLPEN_BIT     5
#define RCC_AHB2LPENR_CRYPLPEN_BIT     4
#define RCC_AHB2LPENR_DCMILPEN_BIT     0 

//RCC AHB3 peripheral clock enable in low power mode register (RCC_AHB3LPENR)
#define RCC_AHB3LPENR_RESET_VALUE  0x00000001
#define RCC_AHB3LPENR_OFFSET       0x58
#define RCC_AHB3LPENR_FSMCLPEN_BIT 0

//RCC APB1 peripheral clock enable in low power mode register (RCC_APB1LPENR)
#define RCC_APB1LPENR_RESET_VALUE   	0x36FEC9FF
#define RCC_APB1LPENR_OFFSET        	0x60
#define RCC_APB1LPENR_DACLPEN_BIT   	29
#define RCC_APB1LPENR_PWRLPEN_BIT   	28
#define RCC_APB1LPENR_CAN2LPEN_BIT  	26
#define RCC_APB1LPENR_CAN1LPEN_BIT  	25
#define RCC_APB1LPENR_I2C3LPEN_BIT  	23 
#define RCC_APB1LPENR_I2C2LPEN_BIT  	22
#define RCC_APB1LPENR_I2C1LPEN_BIT  	21
#define RCC_APB1LPENR_UART5LPEN_BIT 	20 
#define RCC_APB1LPENR_UART4LPEN_BIT 	19 
#define RCC_APB1LPENR_USART3LPEN_BIT	18
#define RCC_APB1LPENR_USART2LPEN_BIT	17
#define RCC_APB1LPENR_SPI3LPEN_BIT 		15
#define RCC_APB1LPENR_SPI2LPEN_BIT 		14 
#define RCC_APB1LPENR_WWDGLPEN_BIT 		11 
#define RCC_APB1LPENR_TIM14LPEN_BIT 	8
#define RCC_APB1LPENR_TIM13LPEN_BIT 	7
#define RCC_APB1LPENR_TIM12LPEN_BIT 	6
#define RCC_APB1LPENR_TIM7LPEN_BIT  	5
#define RCC_APB1LPENR_TIM6LPEN_BIT  	4
#define RCC_APB1LPENR_TIM5LPEN_BIT  	3
#define RCC_APB1LPENR_TIM4LPEN_BIT  	2
#define RCC_APB1LPENR_TIM3LPEN_BIT  	1
#define RCC_APB1LPENR_TIM2LPEN_BIT  	0

//RCC APB2 peripheral clock enable in low power mode register (RCC_APB2LPENR)
#define RCC_APB2LPENR_RESET_VALUE  		0x04075F33
#define RCC_APB2LPENR_OFFSET       		0x64
#define RCC_APB2LPENR_TIM11LPEN_BIT		18
#define RCC_APB2LPENR_TIM10LPEN_BIT		17
#define RCC_APB2LPENR_TIM9LPEN_BIT		16
#define RCC_APB2LPENR_SYSCFGLPEN_BIT    14
#define RCC_APB2LPENR_SPI1LPEN_BIT      12
#define RCC_APB2LPENR_SDIOLPEN_BIT		11
#define RCC_APB2LPENR_ADC3LPEN_BIT		10	
#define RCC_APB2LPENR_ADC2LPEN_BIT		9
#define RCC_APB2LPENR_ADC1LPEN_BIT		8
#define RCC_APB2LPENR_USART6LPEN_BIT    5
#define RCC_APB2LPENR_USART1LPEN_BIT    4
#define RCC_APB2LPENR_TIM8LPEN_BIT      1
#define RCC_APB2LPENR_TIM1LPEN_BIT      0

//RCC Back up domain control register (RCC_BDCR)
#define RCC_BDCR_RESET_VALUE       0x00000000
#define RCC_BDCR_OFFSET            0x70
#define RCC_BDCR_BDRST_BIT         16
#define RCC_BDCR_RTCEN_BIT         15
#define RCC_BDCR_RTCSEL_START      8
#define RCC_BDCR_RTCSEL_MASK       0x00000300
#define RCC_BDCR_LSEBYP_BIT        2
#define RCC_BDCR_LSERDY_BIT        1
#define RCC_BDCR_LSEON_BIT         0

