ChanJoshi/STM32/stm32f407xx_rcc.c
    unsigned output_count;                                                      
    struct Clk *output[CLKTREE_MAX_OUTPUT];                                     
                                                                                
    unsigned input_count;                                                       
    int selected_input;                                                         
    struct Clk *input[CLKTREE_MAX_INPUT];                                       
}; 

/* This function enables the clock if the bit in AHB1ENR is set for the particular GPIO*/
static void stm32_rcc_periph_enable(
									struct stm32f407xx_rcc *s,
									uint32_t new_value,
									bool init,
									int periph,
									uint32_t bit_pos)
									
									
{
	printf ("rcc set 0x%x %s %d %x: %sable\n", new_value, s->PERIPHCLK[periph]->name, periph, bit_pos, (new_value & (1 << bit_pos))? "en":"dis"); 
    clktree_set_enabled(s->PERIPHCLK[periph], (new_value & (1 <<bit_pos)) != 0);
	printf ("%x\n", bit_pos);
} 

/*Register Implemention*/
// function implements the read of important bits that change the clock selection
static uint32_t stm32_rcc_RCC_CR_read(struct stm32f407xx_rcc *s)
{
	//set the clocks
	const bool PLLON = true; //clktree_is_enabled (s->PLLCLK);
	const bool HSEON = true; //clktree_is_enabled (s->HSECLK);
	const bool HSION = true; //clktree_is_enabled (s->HSICLK
	const bool PLLI2SON = true; // clktree_is_enabled (s->PLLI2SCLK);
	
	// if clock is set ready bit is set
	
	return ( 
		GET_BIT_MASK (RCC_CR_PLLRDY_BIT, PLLON) | GET_BIT_MASK(RCC_CR_PLLON_BIT, PLLON) |
		GET_BIT_MASK (RCC_CR_HSERDY_BIT, HSEON) | GET_BIT_MASK(RCC_CR_HSEON_BIT, HSEON) |
		GET_BIT_MASK (RCC_CR_HSIRDY_BIT, HSION) | GET_BIT_MASK(RCC_CR_HSION_BIT, HSION) |
		GET_BIT_MASK (RCC_CR_PLLI2SRDY_BIT, PLLI2SON) | GET_BIT_MASK(RCC_CR_PLLI2SON_BIT, PLLI2SON)
		);                    	
}


/* function implements the setting of clocks if the clocks are not set already
Only one can be selected at a time 
Implemetation is for RCC_CR */

static void stm32_rcc_RCC_CR_write(struct stm32f407xx_rcc *s, uint32_t new_value, bool init)
{
	bool new_PLLON, new_HSEON, new_HSION, new_PLLI2SON;
	
	new_PLLON = IS_BIT_SET(new_value, RCC_CR_PLLON_BIT);
	/*checks if any other clock is set or PLL is already set*/
	if((clktree_is_enabled (s->PLLCLK) &&!new_PLLON) &&
		s->RCC_CFGR_SW == SW_HSE_SELECTED ) {
			printf ( "PLL cannot be disabled while it is selected as the system clock.");
			}
			/* if not sets the PLL clock*/
			clktree_set_enabled(s->PLLCLK, new_PLLON);
			
	new_HSEON=IS_BIT_SET(new_value, RCC_CR_HSEON_BIT);
	/*checks if any other clock is set or HSE is already set*/
	if((clktree_is_enabled (s->HSECLK)&& !new_HSEON) &&
	    (s->RCC_CFGR_SW == SW_HSE_SELECTED || s->RCC_CFGR_SW ==SW_PLL_SELECTED)){
		printf("HSE oscillator cannot be disabled while it is driving the system clock");	
		}
		clktree_set_enabled(s->HSECLK, new_HSEON);
		
	new_HSION=IS_BIT_SET(new_value,RCC_CR_HSION_BIT);
	/*checks if any other clock is set or HSI is already set*/
	if ((clktree_is_enabled(s->HSECLK) && !new_HSION) &&
	    (s->RCC_CFGR_SW == SW_HSI_SELECTED || s->RCC_CFGR_SW == SW_PLL_SELECTED)){
		printf("HSI oscillator cannot be disabled while it is driving the system clock");
		}
		clktree_set_enabled(s->HSICLK,new_HSION);
		 
		
	new_PLLI2SON = IS_BIT_SET (new_value, RCC_CR_PLLI2SON_BIT);
    clktree_set_enabled(s->PLLI2SCLK, new_PLLI2SON);	
	
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_CR_CSSON_BIT, RCC_CR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CR_HSICAL_MASK, RCC_CR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CR_HSITRIM_MASK, RCC_CR_RESET_VALUE);
	
}


//RCC_PLLCFGR register implementation
static uint32_t stm32_rcc_RCC_PLLCFGR_read(struct stm32f407xx_rcc *s){
	return s->RCC_PLLCFGR;
}
	
static void stm32_rcc_RCC_PLLCFGR_write(struct stm32f407xx_rcc *s , uint32_t new_value,bool init)
{
	/*PLLM division factor*/ // uint8 because value ranges from 0-63
	const uint8_t new_PLLM = (new_value & RCC_PLLCFGR_PLLM_MASK) >> RCC_PLLCFGR_PLLM_START;
	if (new_PLLM <= 1){
		hw_error ("PLLM division factor cannot be 0 or 1. Given %u", new_PLLM);
	}
	
	/*PLLN multiplication factor*/ // uint16 because value ranges from 0-511
    const uint16_t new_PLLN = (new_value & RCC_PLLCFGR_PLLN_MASK)>>RCC_PLLCFGR_PLLN_START;
	
		if (new_PLLN <=1 || new_PLLN >=433) {
		hw_error("PLLN multiplication factor must be between 1 to 433(exclusive). Given: %u", new_PLLN);
	}
	
	/*PLLSRC*/
	const uint8_t new_PLLSRC = IS_BIT_SET(new_value, RCC_PLLCFGR_PLLSRC_BIT);
	
	/*PLLP division factor*/
	const uint8_t new_PLLP = 2 + (2 * ((new_value & RCC_PLLCFGR_PLLP_MASK) >> RCC_PLLCFGR_PLLP_START));
	
	//incorrect writes warning
	
	if (init ==false){
		const bool are_disabled = (!clktree_is_enabled(s->PLLCLK));
		if(are_disabled == false) { // PLLM is already running
			const char *warning_fmt = "Can only change %s while PLL is disabled\n";
			if (new_PLLM != s->RCC_PLLCFGR_PLLM) {
				printf(warning_fmt, "PLLM"); // new_value is not same as value set in register
			}
			if (new_PLLN != s->RCC_PLLCFGR_PLLN){
				printf(warning_fmt,"PLLN");
			}
			if (new_PLLSRC != s->RCC_PLLCFGR_PLLSRC){
				printf(warning_fmt, "PLLSRC");
			}
	    }
    }
	
	// save the new clock values
	s->RCC_PLLCFGR =new_value;
	
	/*set the new values*/
	s->RCC_PLLCFGR_PLLM = new_PLLM;
	s->RCC_PLLCFGR_PLLN = new_PLLN;
	clktree_set_scale(s->PLLM, new_PLLN, new_PLLM);
	
	s->RCC_PLLCFGR_PLLSRC =new_PLLSRC;
	clktree_set_selected_input(s->PLLM, new_PLLSRC);
	
	s->RCC_PLLCFGR_PLLP =new_PLLP;
	clktree_set_scale(s->PLLCLK, 1, new_PLLP);
	
	WARN_UNIMPLEMENTED(new_value, RCC_PLLCFGR_PLLQ_MASK, RCC_PLLCFGR_RESET_VALUE);
	
	}



//RCC_CFGR register implementation
static uint32_t stm32_rcc_RCC_CFGR_read(struct stm32f407xx_rcc *s)
{
	return 
	(s->RCC_CFGR_PPRE2 << RCC_CFGR_PPRE2_START) |
	(s->RCC_CFGR_PPRE1 << RCC_CFGR_PPRE1_START) |
	(s->RCC_CFGR_HPRE << RCC_CFGR_HPRE_START)|
	(s->RCC_CFGR_SW << RCC_CFGR_SW_START) |
	(s->RCC_CFGR_SW << RCC_CFGR_SWS_START);
}

static void stm32_rcc_RCC_CFGR_write(struct stm32f407xx_rcc *s, uint32_t new_value, bool init)
{
	/*PPRE2
	  scaling is done by 2/4/8/16 for APB2 */
	s->RCC_CFGR_PPRE2 = (new_value & RCC_CFGR_PPRE2_MASK) >> RCC_CFGR_PPRE2_START;
	if(s->RCC_CFGR_PPRE2 < 0x4) {
		clktree_set_scale (s->PCLK2, 1, 1);
	}
	else{
		clktree_set_scale(s->PCLK2, 1, 2 * (s->RCC_CFGR_PPRE2 - 3));
	}
	
	/* PPRE1 
	   scaling is done by 2/4/8/16 for APB1 */
	s->RCC_CFGR_PPRE1 = (new_value & RCC_CFGR_PPRE1_START) >> RCC_CFGR_PPRE1_START;
    if(s->RCC_CFGR_PPRE1 < 4) {
		clktree_set_scale(s->PCLK1, 1, 1);
	}	
	else{
		clktree_set_scale(s->PCLK1, 1, 2 * (s->RCC_CFGR_PPRE1 - 3));
	}
	
	
	/*HPRE
	  scaling is done by 2/4/8/16..../512 for AHB */
	s->RCC_CFGR_HPRE =(new_value & RCC_CFGR_HPRE_START) >> RCC_CFGR_HPRE_START;
	if(s->RCC_CFGR_HPRE < 8) {
		clktree_set_scale (s->HCLK, 1, 1);
	}
     else {
		clktree_set_scale(s->HCLK, 1, 2* (s->RCC_CFGR_HPRE - 7));
     }		
	
	/*sw*/
	
	s->RCC_CFGR_SW = (new_value & RCC_CFGR_SW_MASK) >> RCC_CFGR_SW_START;
	switch(s->RCC_CFGR_SW){
	case 0x0:
	case 0x1:
	case 0x2:
			clktree_set_selected_input(s->SYSCLK, s->RCC_CFGR_SW);
			break;
	default:
           hw_error("Invalid input selected for SYSCLK");
		   break;
		   
