ChanJoshi/STM32/stm32f407xx_rcc.c
	}	   
	WARN_UNIMPLEMENTED(new_value, RCC_CFGR_MCO2_MASK, RCC_CFGR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CFGR_MCO2PRE_MASK, RCC_CFGR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CFGR_MCO1PRE_MASK, RCC_CFGR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CFGR_I2SSRC_BIT, RCC_CFGR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CFGR_MCO1_MASK, RCC_CFGR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CFGR_RTCPRE_MASK, RCC_CFGR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CFGR_SWS_MASK, RCC_CFGR_RESET_VALUE);	   
	
}	

// RCC_CIR yet to be implemented		
static uint32_t stm32_rcc_RCC_CIR_read(struct stm32f407xx_rcc *s)
{
    return s->RCC_CIR;
}

static void stm32_rcc_RCC_CIR_write(struct stm32f407xx_rcc *s, uint32_t new_value, bool init)
{
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_CSSC_BIT, RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_PLLI2SRDYC_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_PLLRDYC_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_HSERDYC_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_HSIRDYC_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_LSERDYC_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_LSIRDYC_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_PLLI2SRDYIE_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_PLLRDYIE_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_HSERDYIE_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_HSIRDYIE_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_LSERDYIE_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_LSIRDYIE_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_CSSF_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_PLLI2SRDYF_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_PLLRDYF_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_HSERDYF_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_HSIRDYF_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_LSERDYF_BIT , RCC_CIR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CIR_LSIRDYF_BIT , RCC_CIR_RESET_VALUE);
}

//RCC_AHB1ENR register implementation

static uint32_t stm32_rcc_RCC_AHB1ENR_read (struct stm32f407xx_rcc *s)
{
	return s->RCC_AHB1ENR;
}

static void stm32_rcc_RCC_AHB1ENR_write (struct stm32f407xx_rcc *s, uint32_t new_value, bool init)
{
	clktree_set_enabled(s->PERIPHCLK[STM32_DMA2], IS_BIT_SET(new_value, RCC_AHB1ENR_DMA2EN_BIT));
	clktree_set_enabled(s->PERIPHCLK[STM32_DMA1], IS_BIT_SET(new_value, RCC_AHB1ENR_DMA1EN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_CRC],  IS_BIT_SET(new_value, RCC_AHB1ENR_CRCEN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_GPIOI],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_GPIOH],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT)); 
    clktree_set_enabled(s->PERIPHCLK[STM32_GPIOG],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_GPIOF],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
	clktree_set_enabled(s->PERIPHCLK[STM32_GPIOE],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
	clktree_set_enabled(s->PERIPHCLK[STM32_GPIOD],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
	clktree_set_enabled(s->PERIPHCLK[STM32_GPIOC],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
	clktree_set_enabled(s->PERIPHCLK[STM32_GPIOB],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
	clktree_set_enabled(s->PERIPHCLK[STM32_GPIOA],IS_BIT_SET(new_value, RCC_AHB1ENR_GPIOIEN_BIT));
	
	// collect the new value
	s->RCC_AHB1ENR = new_value;
	
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_OTGHSULPIEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_BKPSRAMEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_CCMDATARAMEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_OTGHSEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACPTPEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACRXEN_BIT, RCC_AHB1ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACTXEN_BIT, RCC_AHB1ENR_RESET_VALUE);
		
}

//RCC_AHB2ENR implementation
static uint32_t stm32_rcc_RCC_AHB2ENR_Read  (struct stm32f407xx_rcc *s)
{
	return s->RCC_AHB2ENR;
}

static void stm32_rcc_RCC_AHB2ENR_write (struct stm32f407xx_rcc *s, uint32_t new_value, bool init)
{
  clktree_set_enabled(s->PERIPHCLK[STM32_DCMI_PERIPH], IS_BIT_SET (new_value, RCC_AHB2ENR_DCMIEN_BIT));
  clktree_set_enabled(s->PERIPHCLK[STM32_CRYP_PERIPH], IS_BIT_SET (new_value, RCC_AHB2ENR_CRYPEN_BIT));  
  clktree_set_enabled(s->PERIPHCLK[STM32_HASH_PERIPH], IS_BIT_SET (new_value, RCC_AHB2ENR_HASHEN_BIT));
  clktree_set_enabled(s->PERIPHCLK[STM32_RNG_PERIPH], IS_BIT_SET (new_value, RCC_AHB2ENR_RNGEN_BIT));
  
  s->RCC_AHB2ENR =new_value;
  
  WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB2ENR_OTGFSEN_BIT, RCC_AHB2ENR_RESET_VALUE);

}

// RCC_AHB3ENR implementation
static uint32_t stm32_rcc_RCC_AHB3ENR_read (struct stm32f407xx_rcc *s)
{
	return s->RCC_AHB3ENR;
}

static void stm32_rcc_RCC_AHB3ENR_write (struct stm32f407xx_rcc *s, uint32_t new_value, bool init)
{
	clktree_set_enabled(s->PERIPHCLK[STM32_FSMC], IS_BIT_SET(new_value, RCC_AHB3ENR_FSMCEN_BIT));
	
	s->RCC_AHB3ENR = new_value;
	
}

static void stm32_rcc_RCC_APB2ENR_write(struct stm32f407xx_rcc *s, uint32_t new_value, bool init)

{
	stm32_rcc_periph_enable(s, new_value, init, STM32_SYSCFG, RCC_APB2ENR_SYSCFGEN_BIT);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_APB2ENR_USART1EN_BIT, RCC_APB2ENR_RESET_VALUE);
	WARN_UNIMPLEMENTED(new_value, 1 << RCC_APB2ENR_USART6EN_BIT, RCC_APB2ENR_RESET_VALUE);


s->RCC_APB2ENR =new_value & RCC_APB2ENR_MASK;	

